{
    "common": {
        "name": "linktap",
        "version": "1.0.1",
        "news": {
            "1.0.1": {
                "en": "Update of various dependencies and update to Node 18.",
                "de": "Aktualisierung verschiedener Abhängigkeiten und Update auf Node 18.",
                "ru": "Обновление различных зависимостей и обновление до Node 18.",
                "pt": "Atualização de várias dependências e atualização para o Nó 18.",
                "nl": "Bijwerken van verschillende afhankelijkheden en bijwerken naar Node 18.",
                "fr": "Mise à jour de diverses dépendances et mise à jour vers Node 18.",
                "it": "Aggiornamento di varie dipendenze e aggiornamento al Nodo 18.",
                "es": "Actualización de varias dependencias y actualización a Nodo 18.",
                "pl": "Aktualizacja różnych zależności i aktualizacja do Node 18.",
                "zh-cn": "更新各种依赖项并更新至 Node 18。",
                "uk": "Оновлення різних залежностей та оновлення до Node 18."
            },            
            "0.3.0": {
                "en": "Added support for new devices (ValveLinker and multiple-outlet water timer) with 18-digit IDs.",
                "de": "Unterstützung für neue Geräte (ValveLinker und Wasserzeitschaltuhr mit mehreren Auslässen) mit 18-stelligen IDs hinzugefügt.",
                "ru": "Добавлена поддержка новых устройств (ValveLinker и многорозеточный таймер воды) с 18-значными идентификаторами.",
                "pt": "Adicionado suporte para novos dispositivos (ValveLinker e temporizador de água de saída múltipla) com IDs de 18 dígitos.",
                "nl": "Ondersteuning toegevoegd voor nieuwe apparaten (ValveLinker en watertimer met meerdere uitgangen) met ID's van 18 cijfers.",
                "fr": "Ajout de la prise en charge de nouveaux dispositifs (ValveLinker et programmateur d'eau à sorties multiples) avec des identifiants à 18 chiffres.",
                "it": "È stato aggiunto il supporto per i nuovi dispositivi (ValveLinker e timer per acqua a uscita multipla) con ID a 18 cifre.",
                "es": "Se ha añadido compatibilidad con nuevos dispositivos (ValveLinker y programador de riego de varias salidas) con ID de 18 dígitos.",
                "pl": "Dodano obsługę nowych urządzeń (ValveLinker i zegar sterujący dla wielu wylotów wody) z 18-cyfrowymi identyfikatorami.",
                "zh-cn": "新增了对具有 18 位 ID 的新设备（ValveLinker 和多出水口定时器）的支持。",
                "uk": "Додано підтримку нових пристроїв (ValveLinker та таймер води на декілька виходів) з 18-значними ідентифікаторами."
            },
            "0.2.1": {
                "en": "Updated CI testing & dependencies.",
                "de": "Aktualisierung der CI Tests und Versionsabhängigkeiten",
                "ru": "Обновлено тестирование CI и зависимостей.",
                "pt": "Testes CI e dependências actualizados.",
                "nl": "CI testen en afhankelijkheden bijgewerkt.",
                "fr": "Mise à jour des tests et des dépendances du CI.",
                "it": "Test e dipendenze CI aggiornati.",
                "es": "Actualización de las pruebas y dependencias de CI.",
                "pl": "Zaktualizowane testy CI i zależności.",
                "zh-cn": "更新了CI测试和依赖性。",
                "uk": "Оновлення тестів CI та версійних залежностей"
            },            
            "0.2.0": {
                "en": "Changed types of state 'signal' to number and of button 'StartEcoInstantMode' to boolean.",
                "de": "Der Typ des Zustands 'Signal' wurde in eine Zahl und der der Schaltfläche 'StartEcoInstantMode' in einen booleschen Wert geändert.",
                "ru": "Изменены типы состояния 'signal' на число и кнопки 'StartEcoInstantMode' на boolean.",
                "pt": "Mudou os tipos de 'sinal' de estado para número e de botão 'StartEcoInstantMode' para booleano.",
                "nl": "Gewijzigd type van toestand 'signaal' in getal en van knop 'StartEcoInstantMode' in booleaans.",
                "fr": "Changement des types de l'état 'signal' en nombre et du bouton 'StartEcoInstantMode' en booléen.",
                "it": "Cambiati i tipi di stato 'segnale' in numero e di pulsante 'StartEcoInstantMode' in booleano.",
                "es": "Cambiados los tipos de estado 'señal' a número y de botón 'StartEcoInstantMode' a booleano.",
                "pl": "Zmieniono typy stanu 'signal' na liczbę oraz przycisku 'StartEcoInstantMode' na boolean.",
                "zh-cn": "将状态 '信号' 的类型改为数字，将按钮 'StartEcoInstantMode' 的类型改为布尔值。",
                "uk": "Тип стану 'Сигнал' було змінено на число, а тип кнопки 'Запустити екорежим' - на булеве значення."
            },
            "0.1.9": {
                "en": "Community suggestion: The trigger data points (buttons) now have the status set to false by default.",
                "de": "Vorschlag der Community: Die Triggerdatenpunkte (Buttons) haben jetzt standardmäßig den Status auf false.",
                "ru": "Предложение от сообщества: Триггерные точки данных (кнопки) теперь по умолчанию имеют статус false.",
                "pt": "Sugestão da comunidade: Os pontos de dados de disparo (botões) têm agora o estado definido como falso por defeito.",
                "nl": "Suggestie van de gemeenschap: De trigger datapunten (knoppen) hebben nu standaard de status op false staan.",
                "fr": "Suggestion de la communauté : Les points de données déclencheurs (boutons) ont maintenant le statut défini sur faux par défaut.",
                "it": "Suggerimento dalla comunità: i punti di dati trigger (pulsanti) ora hanno lo stato impostato su false per impostazione predefinita.",
                "es": "Sugerencia de la comunidad: Los puntos de datos de activación (botones) tienen ahora el estado fijado en falso por defecto.",
                "pl": "Sugestia od społeczności: Punkty danych wyzwalacza (przyciski) mają teraz domyślnie ustawiony status na false.",
                "zh-cn": "来自社区的建议：现在触发数据点（按钮）的状态默认设置为假。",
                "uk": "Пропозиція спільноти: Тригерні точки даних (кнопки) тепер за замовчуванням мають статус false.atus."
            },             
            "0.1.8": {
                "en": "Retrieve historical data (API update from manufacturer) and optimize data point settings",
                "de": "Abruf von historischen Daten (API Update vom Hersteller) und Optimierung von Datenpunkteinstellungen.",
                "ru": "Извлекайте исторические данные (обновление API от производителя) и оптимизируйте настройки точек данных.",
                "pt": "Recuperar dados históricos (actualização API do fabricante) e optimizar as definições dos pontos de dados.",
                "nl": "Historische gegevens ophalen (API-update van fabrikant) en datapuntinstellingen optimaliseren.",
                "fr": "Récupérer les données historiques (mise à jour API du fabricant) et optimiser les paramètres des points de données.",
                "it": "Recupera i dati storici (aggiornamento API dal produttore) e ottimizza le impostazioni dei punti dati.",
                "es": "Recuperar los datos históricos (actualización de la API del fabricante) y optimizar la configuración de los puntos de datos.",
                "pl": "Pobieranie danych historycznych (aktualizacja API od producenta) i optymalizacja ustawień punktów danych.",
                "zh-cn": "检索历史数据（来自制造商的API更新）并优化数据点设置。",
                "uk": "Отримання історичних даних (оновлення API від виробника) та оптимізація налаштувань точок даних."
            },             
            "0.1.7": {
                "en": "First public release",
                "de": "Erste öffentliche Version",
                "ru": "Первый публичный релиз",
                "pt": "Primeiro lançamento público",
                "nl": "Eerste publieke release",
                "fr": "Première publication",
                "it": "Prima uscita pubblica",
                "es": "Primera publicación",
                "pl": "Pierwsza publiczna publikacja",
                "zh-cn": "第一次公开发行",
                "uk": "Перша публічна версія"
            }                 
        },
        "connectionType": "cloud",
        "dataSource": "poll",
        "titleLang": {
            "en": "LinkTap",
            "de": "LinkTap",
            "ru": "LinkTap",
            "pt": "LinkTap",
            "nl": "LinkTap",
            "fr": "LinkTap",
            "it": "LinkTap",
            "es": "LinkTap",
            "pl": "LinkTap",
            "zh-cn": "链接点击",
            "uk": "LinkTap"
        },
        "desc": {
            "en": "Control your garden irrigation with the LinkTap Wireless Water Timer",
            "de": "Adapter zur Steuerung der Gartenbewässerung mit dem LinkTap Wireless Water Timer",
            "ru": "Управляйте поливом сада с помощью беспроводного таймера подачи воды LinkTap.",
            "pt": "Controle a irrigação do seu jardim com o temporizador de água sem fios LinkTap",
            "nl": "Bedien uw tuinbevloeiing met de LinkTap Draadloze Watertimer",
            "fr": "Contrôlez l'irrigation de votre jardin grâce au programmateur d'arrosage sans fil LinkTap",
            "it": "Controlla l'irrigazione del tuo giardino con il timer per l'acqua wireless LinkTap",
            "es": "Controla el riego de tu jardín con el temporizador de agua inalámbrico LinkTap",
            "pl": "Sterowanie nawadnianiem ogrodu za pomocą bezprzewodowego wyłącznika czasowego LinkTap",
            "zh-cn": "使用LinkTap无线水定时器控制花园灌溉。",
            "uk": "Адаптер для керування поливом саду за допомогою бездротового таймера LinkTap"
        },
        "authors": [
            "Smart-Gang <gangrulez@gmail.com>"
        ],
        "keywords": [
            "LinkTap",            
            "Irrigation",
            "Taplinker",
            "Wireless Water Timer"
        ],
        "licenseInformation": {
            "license": "MIT",
            "link": "https://github.com/jpawlowski/ioBroker.residents/blob/main/LICENSE",
            "type": "free"
          },
        "platform": "Javascript/Node.js",        
        "icon": "LinkTap_Logo.png",
        "enabled": true,
        "extIcon": "https://raw.githubusercontent.com/Smart-Gang/ioBroker.linktap/master/admin/LinkTap_Logo.png",
        "readme": "https://github.com/Smart-Gang/ioBroker.linktap/blob/master/README.md",
        "loglevel": "info",
        "mode": "daemon",
        "type": "garden",
        "tier": 3,
        "compact": true,
        "adminUI": {
            "config": "json"
        },
        "dependencies": [
            {                
                "js-controller": ">=5.0.19"
            }
        ],
        "globalDependencies" : [
            {
                "admin": ">=5.1.0"                
            }
        ]
    },    
    "native": {        
        "txtUsername": "", 
        "txtApiKey": "",
        "txtPollIntervalWatering": "1",
        "txtPollIntervalHistory": "10",
        "txtPollIntervalDevices": "5"
    },
    "encryptedNative":[
        "txtApiKey"        
    ],    
    "protectedNative": [
        "txtApiKey"
    ],    
    "objects": [],
    "instanceObjects": []
}
